# Parameter Type Id Hosted Property

Source: https://www.revitapidocs.com/2026/5a732ae5-d6ed-553f-c183-fd7f62262e79.htm

---

| Parameter Type Id Hosted Property |
| --- |

"Hosted"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId Hosted { get; }
```

```
Public Shared ReadOnly Property Hosted As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ Hosted {
	ForgeTypeId^ get ();
}
```

```
static member Hosted : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace